app/controllers/live_streams_controller.rb

  def index
    @live_streams = LiveStream.all
---
SELECT "live_streams".* FROM "live_streams"

  def show
    @live_stream = LiveStream.find(params[:id])
---
SELECT  "live_streams".* FROM "live_streams" WHERE "live_streams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]