app/controllers/reports_controller.rb

SELECT "reports".* FROM "reports"
---
  def index
    @reports = Report.all

SELECT  "reports".* FROM "reports" WHERE "reports"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show
    @report = Report.find(params[:id])

INSERT INTO "reports" ("number_accesses", "number_messages_sent", "live_stream_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["number_accesses", 0], ["number_messages_sent", 0], ["live_stream_id", 530], ["created_at", 2017-01-17 14:42:40 UTC], ["updated_at", 2017-01-17 14:42:40 UTC]]
---
  def create
    @report = Report.new(number_accesses: current_chat.number_accesses,
                         number_messages_sent: current_chat.total_messages,
                         live_stream: current_live_stream)

    if @report.save